# 正则分组:用小括号

import re 

# 这里是用小括号和分隔符来分组
m=re.match(r'^(\d{3})-(\d{3,8})$','010-12345')
print(m)
# 使用m.group()方法调用分组后的数值,参数0表示原始字符串,然后递增依次表示后续分组后的数值
print(m.group(0))
print(m.group(1))
print(m.group(2))

t='19:05:30'

# 时针范围是00-23,分针和秒针是00-59
# 就是不明白最后为什么还有个[0-9]
# 删了之后没有出现问题,不知道是不是大佬没想到这个问题
# n=re.match(r'^(0[0-9]|1[0-9]|2[0-3]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])$',t)
n=re.match(r'^(0[0-9]|1[0-9]|2[0-3])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9])$',t)
print(n.group(0))
print(n.group(1))
print(n.group(2))
print(n.group(3))
